In [41]:
#Соколов Илья ИУ5-63Б
# Задача №3.
# Для заданного набора данных произведите масштабирование данных 
# (для одного признака) и преобразование категориальных признаков 
# в количественные двумя способами (label encoding, one hot encoding) для одного признака. 
# Какие методы Вы использовали для решения задачи и почему?

In [42]:
import numpy as np
import pandas as pd
import seaborn as sns

In [43]:
data = pd.read_csv('toy_dataset.csv')

In [44]:
data.head()

   Number    City Gender  Age   Income Illness
0       1  Dallas   Male   41  40367.0      No
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No
4       5  Dallas   Male   46  50289.0      No

In [45]:
data.shape

(150000, 6)

In [46]:
data.isna().sum()

Number     0
City       0
Gender     0
Age        0
Income     0
Illness    0
dtype: int64

In [47]:
data['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [48]:
data = pd.get_dummies(data, columns=['Gender'])

In [49]:
data.head()

   Number    City  Age   Income Illness  Gender_Female  Gender_Male
0       1  Dallas   41  40367.0      No              0            1
1       2  Dallas   54  45084.0      No              0            1
2       3  Dallas   42  52483.0      No              0            1
3       4  Dallas   40  40941.0      No              0            1
4       5  Dallas   46  50289.0      No              0            1

In [50]:
from sklearn.preprocessing import MinMaxScaler

In [51]:
scaler = MinMaxScaler()

In [52]:
data[['Income']] = scaler.fit_transform(data[['Income']])

In [53]:
data.head()

   Number    City  Age    Income Illness  Gender_Female  Gender_Male
0       1  Dallas   41  0.230700      No              0            1
1       2  Dallas   54  0.257228      No              0            1
2       3  Dallas   42  0.298840      No              0            1
3       4  Dallas   40  0.233928      No              0            1
4       5  Dallas   46  0.286501      No              0            1